app/controllers/stations_controller.rb

  def index
    @stations = Station.pluck(:name, :id)
    @results = []
    @n = params[:n] || 0

    @from = params[:from] || Station.where(name: 'East Ham').first.id

    if @n.present? && @n.to_i > 0
      # to_ignore = []
      # ids = [@from]
      # @n.to_i.times do
      #   to_ignore |= ids
      #   ids = StationLink.where(from_id: ids).where.not(to_id: to_ignore).pluck(:to_id)
      #   ids = ids - to_ignore
      # end
      # @results = Station.where(id: ids).order(:name).pluck(:name)

      select_opts = []
      skope = Station.where(id: @from)

      (1..@n.to_i).each do |i|
        prev = i == 1 ? 'id' : "s#{i.to_i - 1}.to_id"
        select_opts << prev if i != @n
        skope =  skope.joins("INNER JOIN station_links AS s#{i} ON s#{i}.from_id = #{prev}")
      end

      res = skope.select("DISTINCT #{select_opts.join(' || "," || ')} AS ignore, s#{@n}.to_id AS last").all
---
SELECT "stations"."name", "stations"."id" FROM "stations"
SELECT  "stations".* FROM "stations" WHERE "stations"."name" = ? ORDER BY "stations"."id" ASC LIMIT ?  [["name", "East Ham"], ["LIMIT", 1]]
SELECT "stations"."name" FROM "stations" WHERE "stations"."id" IN (393, 15, 69, 256, 116, 205, 109, 109, 133, 237, 348, 359, 385, 393, 133, 59, 65, 190, 231, 594, 590, 594, 234, 237, 338, 389, 590, 159, 231, 594, 167, 133, 176, 332, 162, 171, 170, 180, 151, 361) ORDER BY "stations"."name" ASC
SELECT DISTINCT id || "," || s1.to_id || "," || s2.to_id || "," || s3.to_id || "," || s4.to_id AS ignore, s5.to_id AS last FROM "stations" INNER JOIN station_links AS s1 ON s1.from_id = id INNER JOIN station_links AS s2 ON s2.from_id = s1.to_id INNER JOIN station_links AS s3 ON s3.from_id = s2.to_id INNER JOIN station_links AS s4 ON s4.from_id = s3.to_id INNER JOIN station_links AS s5 ON s5.from_id = s4.to_id WHERE "stations"."id" = ?  [["id", 157]]